; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	image1 - mode
	infrared3 - mode
	infrared0 - mode
	thermograph2 - mode
	Star0 - direction
	GroundStation3 - direction
	Star2 - direction
	Star1 - direction
	Star4 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 infrared3)
	(supports instrument0 image1)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 infrared3)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 infrared3)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star2)
	(supports instrument4 image1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star1)
	(supports instrument5 thermograph2)
	(supports instrument5 image1)
	(calibration_target instrument5 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument6 infrared0)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star1)
	(supports instrument7 image1)
	(supports instrument7 infrared3)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 Star4)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
	(supports instrument8 thermograph2)
	(supports instrument8 infrared0)
	(supports instrument8 infrared3)
	(calibration_target instrument8 Star4)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
)
(:goal (and
	(pointing satellite0 Star1)
	(pointing satellite1 Star2)
	(have_image Planet5 thermograph2)
	(have_image Star6 image1)
	(have_image Planet7 thermograph2)
	(have_image Planet8 infrared3)
))

)

; plan
1. (turn_to satellite2 star4 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star4)
   goals met: 0 of 6
2. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 6
3. (calibrate satellite2 instrument7 star4)
   added: (calibrated instrument7)
   goals met: 0 of 6
4. (turn_to satellite2 planet7 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 planet7)
   goals met: 0 of 6
5. (take_image satellite2 planet7 instrument7 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 1 of 6
6. (turn_to satellite2 planet5 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 planet5)
   goals met: 1 of 6
7. (turn_to satellite0 star1 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star1)
   goals met: 2 of 6
8. (take_image satellite2 planet5 instrument7 thermograph2)
   added: (have_image planet5 thermograph2)
   goals met: 3 of 6
9. (turn_to satellite1 star2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star2)
   goals met: 4 of 6
10. (turn_to satellite2 planet8 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet8)
   goals met: 4 of 6
11. (take_image satellite2 planet8 instrument7 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 5 of 6
12. (turn_to satellite2 star6 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star6)
   goals met: 5 of 6
13. (take_image satellite2 star6 instrument7 image1)
   added: (have_image star6 image1)
   goals met: 6 of 6
